#include <bits/stdc++.h>
using namespace std;

unordered_map<int, vector<string>> ranking = {
    {1, {"ธนบดี สีห์โสภณ"}},
    {2, {"ภาคิน โอฬารรักษ์ธรรม"}},
    {3, {"กานต์ ศุภการพิทยากุล"}},
    {4, {"ธนัท ก้องเกียรติกมล"}},
    {5, {"ณกร พงษ์ภาสุระ"}},
    {6, {"ชวกร ชาตะวะสุ", "ศุภกร ตั้งจิตร์พร"}},
    {8, {"สุวิจักขณ์ อ่วมขยัน"}},
    {9, {"ไวกูณฐ์ นันทิวัชรินทร์"}},
    {10, {"ภาคภูมิ เกียรติวนิชวิไล"}},
    {11, {"คณพศ กาญจนสินิทธ์"}},
    {12, {"ปริญ มิตรารัตน์"}},
    {13, {"ปพนพัทธ์ สิริรวมทรัพย์"}},
    {14, {"ระพีร์พัชญ์ พันธ์มี"}},
    {15, {"ภาคิน ธัญนพคชาบาล"}},
    {16, {"วัชรภณ เชาว์ปฏิภาณ"}},
    {17, {"ธีธัช จันทน์เสนะ"}},
    {18, {"กฤษณพล เมฆสมุทร", "นันทพัทธ์ ไหลประเสริฐ"}},
    {20, {"ณัฐภณ ทับทิมโต"}},
    {21, {"ภาคิน สุขจันทร์"}},
    {22, {"ยชญ์ขพันธ์ สายชล"}},
    {23, {"ภัทรพล เหล่าสมาธิกุล"}},
    {24, {"วรภณ ตัณฑุลเวศม์", "ปยุต ศรีสารคาม"}},
    {26, {"ธิติวุฒิ ศรีวะสุทธิ์"}},
    {27, {"คณพศ เพชรมณี"}},
    {28, {"พุฒิเศรษฐ์ อนุสนธิวงษ์"}},
    {29, {"กิตติธัช ทิพย์มณฑา"}},
    {30, {"รังสิกร ช่างเก็บ"}},
    {31, {"ปาณิสรา โฆษิตสุรังคกุล"}},
    {32, {"พัชรภณ กีรติไกรกุล"}},
    {33, {"ณัฏฐพล ศรีสัตยากุล"}},
    {34, {"ชนัญธิดา ธนะสารสมบูรณ์"}},
    {35, {"วรธน โกเมนจรัสวงศ์"}},
    {36, {"อภิชา จันทรสิทธิ์"}},
    {37, {"ศิวัช จารุรัชตพันธ์", "พิสิษฐ์ อภิรัตน์วรากุล"}},
    {39, {"พุฒิเมธ พรหมอ่อน"}},
    {40, {"สร้างบุณ พลาศรี"}},
    {41, {"ฌิกศา กาญจนรัตนเพ็ญ"}},
    {42, {"ธันวิน จินตนาภักดี", "คณุตม์ อุตอามาต"}},
    {44, {"ภาณุวัฒน์ ศรีบาง", "มัรยัมอนีส อัฮมัดมูซา"}},
    {46, {"ชิษณุพงษ์ รองปาน"}},
    {47, {"อัมมัร สาและ", "ศุภกร เผ่าเนตร์"}},
    {49, {"ฐิติกร คำอ้าย"}},
    {50, {"อมตะ ฐิติวานนท์", "ภูริณัฐ ทองสว่าง"}},
    {52, {"ณฐวัฒน์ ยังยิ้ม"}},
    {53, {"ปทิตตา โอฬารวณิช"}},
    {54, {"มนพล ตั้งทางธรรม", "นัธทวัฒน์ บูรณไมตรี", "ชวิศ ภูไชยแสง", "วรินทร ออคูณสวัสดิ์", "รณกร แก้วกียูร", "พสิษฐ์ แสงประชาธนารักษ์"}},
    {60, {"สรวิชญ์ แดงเผือก"}},
    {61, {"ธนะพัฒน์ จันทร์เด่นดวง"}},
    {62, {"นิธิศ สิทธิราช"}},
    {63, {"พีรเวธน์ ธีรการย์ชัย"}},
    {64, {"ธราเทพ ติยวรนันท์", "วรากร เหมจินดา"}},
    {66, {"มาโคโตะ มิโยชิ", "ยศวัฒน์ โลหะศิริวัฒน์"}},
    {68, {"จักรินทร์ เจียมสูงส่ง"}},
    {69, {"ตุลชาติ โมลีวิศิลา"}},
    {70, {"ปองภพ เขียวเล็ก"}},
    {71, {"ภัทรกร วิรติกุล"}},
    {72, {"ณพวุฒิ สิริวัสนคุปต์"}},
    {73, {"วีรวิชญ์ โชติจุฬางกูร"}},
    {74, {"ธนัญชัย ปัญญา"}},
    {75, {"กวิน แก้วเนิน"}},
    {76, {"ณัฏฐนิตา สุรเดช"}},
    {77, {"ณัฐดนัย วงศ์สมศักดิ์"}},
    {78, {"กันตินันท์ สวัสดิ์วงษ์", "สรกล สุขสบาย", "ธนปรรณ แมกไม้รักษา"}},
    {81, {"ธนกฤต กาหยี", "พรนัชชา ตฤษณวสุนธรา"}},
    {83, {"ปัณณ์ เหลืองนทีเทพ"}},
    {84, {"สรรเพชญ เสถียรขจรกุล"}},
    {85, {"พิทวัส กัญญะลา", "ณ รัก ชัยแก้ว", "ธนวินท์ ธฤตกุลวณิชย์", "ธีรพงศ์ ธีรศาสตร์", "ณชพล บุญวังแร่", "รวิภัทร พรตั้งจิตลิขิต", "ปุญญพัฒน์ พรหมประภัศศร", "ธนดล พุ่มโกสุม", "รณัสถ์ชัย วงศ์อนันต์", "สิริเวชช์ วัฒนะ", "อิรซาด สาแม", "คุณานนท์ หาญทวิชัย", "พีรวิชญ์ อินทรโม", "ราชพฤกษ์ แซ่ตัน", "ธีรดนย์ โกละกะ"}}
};

int main() {
    ios::sync_with_stdio(false);
    cin.tie(nullptr);

    int n;
    cin >> n;

    if (ranking.count(n)) {
        vector<string> &names = ranking[n];
        for (auto &name : names) {
            cout << name << "\n";
        }
    } else cout << 8296;

    return 0;
}
